vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/common/SPI_TYPE_A_registers.h
/* Common SPI_TYPE_A — generated by stm32_reggen.py.
 * Do not edit this file manually!
 * Superset across: stm32f030, stm32f427, stm32g070, stm32c092
 */

#pragma once
#include "../../stm32_gen_common.h"
#include "SPI_TYPE_A_index.h"

typedef union {
	struct {
		uint32_t CPHA          : 1; // /*!< Clock Phase */
		uint32_t CPOL          : 1; // /*!< Clock Polarity */
		uint32_t MSTR          : 1; // /*!< Master Selection */
		uint32_t BR            : 3; // /*!< BR[2:0] bits (Baud Rate Control) */
		uint32_t SPE           : 1; // /*!< SPI Enable */
		uint32_t LSBFIRST      : 1; // /*!< Frame Format */
		uint32_t SSI           : 1; // /*!< Internal slave select */
		uint32_t SSM           : 1; // /*!< Software slave management */
		uint32_t RXONLY        : 1; // /*!< Receive only */
		uint32_t DFF           : 1; // /*!<Data Frame Format                   */
		uint32_t CRCNEXT       : 1; // /*!< Transmit CRC next */
		uint32_t CRCEN         : 1; // /*!< Hardware CRC calculation enable */
		uint32_t BIDIOE        : 1; // /*!< Output enable in bidirectional mode */
		uint32_t BIDIMODE      : 1; // /*!< Bidirectional data mode enable */
		uint32_t _reserved16   :16;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_spi_type_a,cr1);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_spi_type_a,cr1),bits);

typedef union {
	struct {
		uint32_t RXDMAEN       : 1; // /*!< Rx Buffer DMA Enable */
		uint32_t TXDMAEN       : 1; // /*!< Tx Buffer DMA Enable */
		uint32_t SSOE          : 1; // /*!< SS Output Enable */
		uint32_t NSSP          : 1; // /*!< NSS pulse management Enable */
		uint32_t FRF           : 1; // /*!< Frame Format Enable */
		uint32_t ERRIE         : 1; // /*!< Error Interrupt Enable */
		uint32_t RXNEIE        : 1; // /*!< RX buffer Not Empty Interrupt Enable */
		uint32_t TXEIE         : 1; // /*!< Tx buffer Empty Interrupt Enable */
		uint32_t DS            : 4; // /*!< DS[3:0] Data Size */
		uint32_t FRXTH         : 1; // /*!< FIFO reception Threshold */
		uint32_t LDMARX        : 1; // /*!< Last DMA transfer for reception */
		uint32_t LDMATX        : 1; // /*!< Last DMA transfer for transmission */
		uint32_t _reserved15   :17;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_spi_type_a,cr2);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_spi_type_a,cr2),bits);

typedef union {
	struct {
		uint32_t RXNE          : 1; // /*!< Receive buffer Not Empty */
		uint32_t TXE           : 1; // /*!< Transmit buffer Empty */
		uint32_t CHSIDE        : 1; // /*!<Channel side             */
		uint32_t UDR           : 1; // /*!<Underrun flag            */
		uint32_t CRCERR        : 1; // /*!< CRC Error flag */
		uint32_t MODF          : 1; // /*!< Mode fault */
		uint32_t OVR           : 1; // /*!< Overrun flag */
		uint32_t BSY           : 1; // /*!< Busy flag */
		uint32_t FRE           : 1; // /*!< TI frame format error */
		uint32_t FRLVL         : 2; // /*!< FIFO Reception Level */
		uint32_t FTLVL         : 2; // /*!< FIFO Transmission Level */
		uint32_t _reserved13   :19;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_spi_type_a,sr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_spi_type_a,sr),bits);

typedef union {
	struct {
		uint32_t DR            :32; // /*!< Data Register */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_spi_type_a,dr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_spi_type_a,dr),bits);

typedef union {
	struct {
		uint32_t CRCPOLY       :32; // /*!< CRC polynomial register */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_spi_type_a,crcpr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_spi_type_a,crcpr),bits);

typedef union {
	struct {
		uint32_t RXCRC         :32; // /*!< Rx CRC Register */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_spi_type_a,rxcrcr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_spi_type_a,rxcrcr),bits);

typedef union {
	struct {
		uint32_t TXCRC         :32; // /*!< Tx CRC Register */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_spi_type_a,txcrcr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_spi_type_a,txcrcr),bits);

typedef union {
	struct {
		uint32_t CHLEN         : 1; // /*!<Channel length (number of bits per audio channel) */
		uint32_t DATLEN        : 2; // /*!<DATLEN[1:0] bits (Data length to be transferred)  */
		uint32_t CKPOL         : 1; // /*!<steady state clock polarity               */
		uint32_t I2SSTD        : 2; // /*!<I2SSTD[1:0] bits (I2S standard selection) */
		uint32_t _reserved6    : 1;
		uint32_t PCMSYNC       : 1; // /*!<PCM frame synchronization                 */
		uint32_t I2SCFG        : 2; // /*!<I2SCFG[1:0] bits (I2S configuration mode) */
		uint32_t I2SE          : 1; // /*!<I2S Enable         */
		uint32_t I2SMOD        : 1; // /*!< Keep for compatibility */
		uint32_t ASTRTEN       : 1; // /*!<Asynchronous start enable */
		uint32_t _reserved13   :19;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_spi_type_a,i2scfgr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_spi_type_a,i2scfgr),bits);

typedef union {
	struct {
		uint32_t I2SDIV        : 8; // /*!<I2S Linear prescaler         */
		uint32_t ODD           : 1; // /*!<Odd factor for the prescaler */
		uint32_t MCKOE         : 1; // /*!<Master Clock Output Enable   */
		uint32_t _reserved10   :22;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_spi_type_a,i2spr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_spi_type_a,i2spr),bits);

typedef union {
	struct {
		REGDEF_NAME(com_spi_type_a,cr1) CR1;
		REGDEF_NAME(com_spi_type_a,cr2) CR2;
		REGDEF_NAME(com_spi_type_a,sr) SR;
		REGDEF_NAME(com_spi_type_a,dr) DR;
		REGDEF_NAME(com_spi_type_a,crcpr) CRCPR;
		REGDEF_NAME(com_spi_type_a,rxcrcr) RXCRCR;
		REGDEF_NAME(com_spi_type_a,txcrcr) TXCRCR;
		REGDEF_NAME(com_spi_type_a,i2scfgr) I2SCFGR;
		REGDEF_NAME(com_spi_type_a,i2spr) I2SPR;
	} /*QEMU_PACKED*/;
	uint32_t raw[RI_END];
}  REGDEF_NAME(stm32com,spi_type_a);
QEMU_BUILD_BUG_MSG(sizeof(REGDEF_NAME(stm32com,spi_type_a)) != sizeof(uint32_t)*RI_END , "Structure Size mismatch - expected uint32[RI_END]");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,spi_type_a), CR1) != 0, "Offset mismatch for CR1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,spi_type_a), CR2) != 4, "Offset mismatch for CR2");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,spi_type_a), SR) != 8, "Offset mismatch for SR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,spi_type_a), DR) != 12, "Offset mismatch for DR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,spi_type_a), CRCPR) != 16, "Offset mismatch for CRCPR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,spi_type_a), RXCRCR) != 20, "Offset mismatch for RXCRCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,spi_type_a), TXCRCR) != 24, "Offset mismatch for TXCRCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,spi_type_a), I2SCFGR) != 28, "Offset mismatch for I2SCFGR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,spi_type_a), I2SPR) != 32, "Offset mismatch for I2SPR");
